In [1]:
import pandas as pd

In [7]:
data = ({'a' : [1,2,3,4,],
         'b' : [5,6,7,8],
         'c' : ['sudg', 'krish', 'hitesh', "navin"]})

In [8]:
pd.DataFrame(data)

   a  b       c
0  1  5    sudg
1  2  6   krish
2  3  7  hitesh
3  4  8   navin

In [9]:
df = pd.DataFrame(data)

In [10]:
df

   a  b       c
0  1  5    sudg
1  2  6   krish
2  3  7  hitesh
3  4  8   navin

In [11]:
df.set_index('a')

   b       c
a
1  5    sudg
2  6   krish
3  7  hitesh
4  8   navin

In [12]:
df

   a  b       c
0  1  5    sudg
1  2  6   krish
2  3  7  hitesh
3  4  8   navin

In [13]:
df.set_index('a', inplace = True)

In [14]:
df

   b       c
a
1  5    sudg
2  6   krish
3  7  hitesh
4  8   navin

In [15]:
# ise data ko reset krna ho to

df.reset_index()

   a  b       c
0  1  5    sudg
1  2  6   krish
2  3  7  hitesh
3  4  8   navin

In [ ]:
df

   b       c
a
1  5    sudg
2  6   krish
3  7  hitesh
4  8   navin

In [17]:
df = df.reset_index()

In [18]:
df

   a  b       c
0  1  5    sudg
1  2  6   krish
2  3  7  hitesh
3  4  8   navin

In [53]:
data = ({'a' : [1,2,3,4,],
         'b' : [5,6,7,8],
         'c' : ['sudh', 'krish', 'hitesh', "navin"]})
df1 = pd.DataFrame(data, index=['a', 'b','c','d'])

In [54]:
df1

   a  b       c
a  1  5    sudh
b  2  6   krish
c  3  7  hitesh
d  4  8   navin

In [55]:
# reindixing kerna hai = inka arragement change kr diya

In [56]:
df1 = df1.reindex(['b','c','d','a'])

In [57]:
df1

   a  b       c
b  2  6   krish
c  3  7  hitesh
d  4  8   navin
a  1  5    sudh

In [58]:
df1.iterrows()

In [59]:
for i in df1.iterrows():
    print(i)   # rowwise data  de dega

('b', a        2
b        6
c    krish
Name: b, dtype: object)
('c', a         3
b         7
c    hitesh
Name: c, dtype: object)
('d', a        4
b        8
c    navin
Name: d, dtype: object)
('a', a       1
b       5
c    sudh
Name: a, dtype: object)

In [60]:
for i,j in df1.iterrows():
    print(i,j)

b a        2
b        6
c    krish
Name: b, dtype: object
c a         3
b         7
c    hitesh
Name: c, dtype: object
d a        4
b        8
c    navin
Name: d, dtype: object
a a       1
b       5
c    sudh
Name: a, dtype: object

In [61]:
for i in df1.items():
    print(i)   # columns wise data de rha hai

('a', b    2
c    3
d    4
a    1
Name: a, dtype: int64)
('b', b    6
c    7
d    8
a    5
Name: b, dtype: int64)
('c', b     krish
c    hitesh
d     navin
a      sudh
Name: c, dtype: object)

In [62]:
df1

   a  b       c
b  2  6   krish
c  3  7  hitesh
d  4  8   navin
a  1  5    sudh

In [63]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [64]:
[i for i in df['b']]

[5, 6, 7, 8]

In [65]:
df1

   a  b       c
b  2  6   krish
c  3  7  hitesh
d  4  8   navin
a  1  5    sudh

In [67]:
# ab muje ager sum krna hai

In [68]:
def test(x):
    return x.sum()
df1.apply(test)

a                      10
b                      26
c    krishhiteshnavinsudh
dtype: object

In [71]:
df2 = df1[['a','b']]

In [72]:
df2

   a  b
b  2  6
c  3  7
d  4  8
a  1  5

In [73]:
df2.applymap(lambda x : x**2)

C:\Users\viren\AppData\Local\Temp\ipykernel_4744\4004635628.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df2.applymap(lambda x : x**2)

    a   b
b   4  36
c   9  49
d  16  64
a   1  25

In [74]:
df1

   a  b       c
b  2  6   krish
c  3  7  hitesh
d  4  8   navin
a  1  5    sudh

In [75]:
df1.reset_index()

  index  a  b       c
0     b  2  6   krish
1     c  3  7  hitesh
2     d  4  8   navin
3     a  1  5    sudh

In [76]:
df1

   a  b       c
b  2  6   krish
c  3  7  hitesh
d  4  8   navin
a  1  5    sudh

In [79]:
df.sort_values('c')

   a  b       c
2  3  7  hitesh
1  2  6   krish
3  4  8   navin
0  1  5    sudg

In [82]:
df.sort_index(ascending = False)

   a  b       c
3  4  8   navin
2  3  7  hitesh
1  2  6   krish
0  1  5    sudg

In [87]:
pd.set_option("display.max_colwidth" ,1000)
df3 = pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language."] })

In [88]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.

In [89]:
pd.set_option("display.max_colwidth" ,1000)
df3 = pd.DataFrame({"Desc" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language." , "my name is sudh" ,"i use to teach data science "] })

In [90]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            Desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                my name is sudh
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   i use to teach data science

In [93]:
df3['len'] = df3['Desc'].apply(len)

In [94]:
df3

,Desc,len
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,my name is sudh,15
2,i use to teach data science,28

In [98]:
# muje character nhi word chaiye

t = "i use to teach data science"
t.split()
len(t.split())

6

In [104]:
df3['word_count' ] = df3['Desc'].apply(lambda x : len(x.split()))

In [105]:
df3

,Desc,len,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765,104
1,my name is sudh,15,4
2,i use to teach data science,28,6

In [106]:
df

   a  b       c
0  1  5    sudg
1  2  6   krish
2  3  7  hitesh
3  4  8   navin

In [107]:
df['a'].mean()

np.float64(2.5)

In [108]:
df['a'].sum()

np.int64(10)

In [109]:
df['a'].median()

2.5

In [110]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [111]:
df['a'].std()

1.2909944487358056

In [115]:
# Python Pandas Window Function

df4 = pd.DataFrame({'a' : [3,4,5,2,1,3,4,5,6]})

In [116]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [ ]:
df4['a'].rolling(window = 2)

Rolling [window=2,center=False,axis=0,method=single]

In [122]:
df4['a'].rolling(window = 1).mean()

0    3.0
1    4.0
2    5.0
3    2.0
4    1.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [123]:
df4['a'].rolling(window = 2).mean()

0    NaN
1    3.5
2    4.5
3    3.5
4    1.5
5    2.0
6    3.5
7    4.5
8    5.5
Name: a, dtype: float64

In [124]:
df4['a'].rolling(window = 3).mean()

0         NaN
1         NaN
2    4.000000
3    3.666667
4    2.666667
5    2.000000
6    2.666667
7    4.000000
8    5.000000
Name: a, dtype: float64

In [125]:
df4['a'].rolling(window = 3).sum()

0     NaN
1     NaN
2    12.0
3    11.0
4     8.0
5     6.0
6     8.0
7    12.0
8    15.0
Name: a, dtype: float64

In [126]:
df4['a'].rolling(window = 3).min()

0    NaN
1    NaN
2    3.0
3    2.0
4    1.0
5    1.0
6    1.0
7    3.0
8    4.0
Name: a, dtype: float64

In [127]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [129]:
df4['a'].rolling(window = 2).max()

0    NaN
1    4.0
2    5.0
3    5.0
4    2.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [130]:
df4['a'].cumsum()

0     3
1     7
2    12
3    14
4    15
5    18
6    22
7    27
8    33
Name: a, dtype: int64

In [134]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

Python Pandas Date Functionality

In [136]:
# Python Pandas Date Functionality

date = pd.date_range(start = '2026-01-01', end = '2026-01-20')

In [137]:
date

DatetimeIndex(['2026-01-01', '2026-01-02', '2026-01-03', '2026-01-04',
               '2026-01-05', '2026-01-06', '2026-01-07', '2026-01-08',
               '2026-01-09', '2026-01-10', '2026-01-11', '2026-01-12',
               '2026-01-13', '2026-01-14', '2026-01-15', '2026-01-16',
               '2026-01-17', '2026-01-18', '2026-01-19', '2026-01-20'],
              dtype='datetime64[ns]', freq='D')

In [143]:
df_date = pd.DataFrame({'date' : date})

In [144]:
df_date

         date
0  2026-01-01
1  2026-01-02
2  2026-01-03
3  2026-01-04
4  2026-01-05
5  2026-01-06
6  2026-01-07
7  2026-01-08
8  2026-01-09
9  2026-01-10
10 2026-01-11
11 2026-01-12
12 2026-01-13
13 2026-01-14
14 2026-01-15
15 2026-01-16
16 2026-01-17
17 2026-01-18
18 2026-01-19
19 2026-01-20

In [151]:
df_date.dtypes

date    datetime64[ns]
dtype: object

In [152]:
df7 = pd.DataFrame({"date" : ['2023-06-23' , '2023-06-22','2023-06-20']})

In [153]:
df7

         date
0  2023-06-23
1  2023-06-22
2  2023-06-20

In [154]:
df7.dtypes

date    object
dtype: object

In [156]:
df7['update_date'] = pd.to_datetime(df7['date'])

In [157]:
df7

         date update_date
0  2023-06-23  2023-06-23
1  2023-06-22  2023-06-22
2  2023-06-20  2023-06-20

In [159]:
df7.dtypes

date                   object
update_date    datetime64[ns]
dtype: object